busy-app/busybar-firmware/lib/simplicity_sdk_new/devices/platform/Device/SiliconLabs/BGM27/Include/bgm27_devinfo.h
/* Bit fields for DEVINFO CCLOAD54 */
#define _DEVINFO_CCLOAD54_RESETVALUE                             0x00000000UL                              /**< Default value for DEVINFO_CCLOAD54          */
#define _DEVINFO_CCLOAD54_MASK                                   0xFFFFFFFFUL                              /**< Mask for DEVINFO_CCLOAD54                   */
#define _DEVINFO_CCLOAD54_CCLOAD4_SHIFT                          0                                         /**< Shift value for DEVINFO_CCLOAD4             */
#define _DEVINFO_CCLOAD54_CCLOAD4_MASK                           0xFFFFUL                                  /**< Bit mask for DEVINFO_CCLOAD4                */
#define _DEVINFO_CCLOAD54_CCLOAD4_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for DEVINFO_CCLOAD54           */
#define DEVINFO_CCLOAD54_CCLOAD4_DEFAULT                         (_DEVINFO_CCLOAD54_CCLOAD4_DEFAULT << 0)  /**< Shifted mode DEFAULT for DEVINFO_CCLOAD54   */
#define _DEVINFO_CCLOAD54_CCLOAD5_SHIFT                          16                                        /**< Shift value for DEVINFO_CCLOAD5             */
#define _DEVINFO_CCLOAD54_CCLOAD5_MASK                           0xFFFF0000UL                              /**< Bit mask for DEVINFO_CCLOAD5                */
#define _DEVINFO_CCLOAD54_CCLOAD5_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for DEVINFO_CCLOAD54           */
#define DEVINFO_CCLOAD54_CCLOAD5_DEFAULT                         (_DEVINFO_CCLOAD54_CCLOAD5_DEFAULT << 16) /**< Shifted mode DEFAULT for DEVINFO_CCLOAD54   */

/* Bit fields for DEVINFO CCLOAD76 */
#define _DEVINFO_CCLOAD76_RESETVALUE                             0x00000000UL                              /**< Default value for DEVINFO_CCLOAD76          */
#define _DEVINFO_CCLOAD76_MASK                                   0xFFFFFFFFUL                              /**< Mask for DEVINFO_CCLOAD76                   */
#define _DEVINFO_CCLOAD76_CCLOAD6_SHIFT                          0                                         /**< Shift value for DEVINFO_CCLOAD6             */
#define _DEVINFO_CCLOAD76_CCLOAD6_MASK                           0xFFFFUL                                  /**< Bit mask for DEVINFO_CCLOAD6                */
#define _DEVINFO_CCLOAD76_CCLOAD6_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for DEVINFO_CCLOAD76           */
#define DEVINFO_CCLOAD76_CCLOAD6_DEFAULT                         (_DEVINFO_CCLOAD76_CCLOAD6_DEFAULT << 0)  /**< Shifted mode DEFAULT for DEVINFO_CCLOAD76   */
#define _DEVINFO_CCLOAD76_CCLOAD7_SHIFT                          16                                        /**< Shift value for DEVINFO_CCLOAD7             */
#define _DEVINFO_CCLOAD76_CCLOAD7_MASK                           0xFFFF0000UL                              /**< Bit mask for DEVINFO_CCLOAD7                */
#define _DEVINFO_CCLOAD76_CCLOAD7_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for DEVINFO_CCLOAD76           */
#define DEVINFO_CCLOAD76_CCLOAD7_DEFAULT                         (_DEVINFO_CCLOAD76_CCLOAD7_DEFAULT << 16) /**< Shifted mode DEFAULT for DEVINFO_CCLOAD76   */

/** @} End of group BGM27_DEVINFO_BitFields */
/** @} End of group BGM27_DEVINFO */
/** @} End of group Parts */

#endif // BGM27_DEVINFO_H
